IP_Scanner/ProbeMatches.txt

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:enc="http://www.w3.org/2003/05/soap-encoding" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:tds="http://www.onvif.org/ver10/device/wsdl">

<s:Header>
	<wsa:MessageID>uuid:AF68E009-90DA-6A18-B34B-90DA6A18B34B</wsa:MessageID>
	<wsa:RelatesTo>uuid:7e768c12-145f-45e1-94c4-dcf5a37d450c</wsa:RelatesTo>
	<wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
	<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
</s:Header>

<s:Body>
	<d:ProbeMatches>
		<d:ProbeMatch>
			<wsa:EndpointReference>
				<wsa:Address>urn:uuid:AF68E009-90DA-6A18-B34B-90DA6A18B34B</wsa:Address>
			</wsa:EndpointReference>
			<d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
			<d:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/type/audio_encoder onvif://www.onvif.org/type/Network_Video_Transmitter onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/hardware/UND-610 onvif://www.onvif.org/Profile/T onvif://www.onvif.org/name/UND-610 onvif://www.onvif.org/location/country/korea</d:Scopes>
			<d:XAddrs>http://192.168.0.132:80/onvif/device_service</d:XAddrs>
			<d:MetadataVersion>1</d:MetadataVersion>
		</d:ProbeMatch>
	</d:ProbeMatches>
</s:Body>
</s:Envelope>